content/posts/antonello2018.md
+++
title = "antonello2018 | A Dual Quaternion Feedback Linearized Approach for Maneuver Regulation of Rigid Bodies"
author = ["João Gutemberg Farias"]
draft = false
+++

The work proposes a [Maneuver Regulation]({{< relref "maneuver_regulation" >}}) Feedback Linearization Controller using dual quaternions for a 6Dof free body. The results show better results for the Maneuver Regulation than the [Trajectory Tracking]({{< relref "trajectory_tracking" >}}).


## Info {#info}

The adoption of the dual quaternion formalism to represent the pose (position and orientation) of a rigid body allows to design a single controller to regulate both its position and its attitude. In this letter, we adopt such a pose representation to develop an exponentially stable maneuver regulation control law, ensuring robust path following in the presence of disturbances. The designed solution relies on the feedback linearized model of the dual quaternion based dynamics of the rigid body. Numerical results confirm the effectiveness of the proposed maneuver regulation approach when compared with trajectory tracking in a noisy scenario.


## Notes {#notes}


### Resumo {#resumo}

The work proposes a [Maneuver Regulation]({{< relref "maneuver_regulation" >}}) Feedback Linearization Controller using dual quaternions for a 6Dof free body. The results show better results for the Maneuver Regulation than the [Trajectory Tracking]({{< relref "trajectory_tracking" >}}).
